AhmtYldz0772/deneme/SHM/SHM_20211202/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/NETAS_Photon_Firmware _FreeRTOS-eski/main.c
                    MibRequestConfirm_t mibReq;

                    mibReq.Type = MIB_ADR;
                    mibReq.Param.AdrEnable = true;
                    LoRaMacMibSetRequestConfirm(&mibReq);

#if defined(REGION_EU868)
                    LoRaMacTestSetDutyCycleOn(false);
#endif
                }
            }
            else
            {
                ComplianceTest.State = mcpsIndication->Buffer[0];
                switch (ComplianceTest.State)
                {
                case 0: // Check compliance test disable command (ii)
                    IsTxConfirmed = LORAWAN_CONFIRMED_MSG_ON;
                    AppPort = LORAWAN_APP_PORT;
                    AppDataSize = AppDataSizeBackup;
                    ComplianceTest.DownLinkCounter = 0;
                    ComplianceTest.Running = false;

                    MibRequestConfirm_t mibReq;
                    mibReq.Type = MIB_ADR;
                    mibReq.Param.AdrEnable = LORAWAN_ADR_ON;
                    LoRaMacMibSetRequestConfirm(&mibReq);
#if defined(REGION_EU868)
                    LoRaMacTestSetDutyCycleOn(LORAWAN_DUTYCYCLE_ON);
#endif
                    break;
                case 1: // (iii, iv)
                    AppDataSize = 2;
                    break;
                case 2: // Enable confirmed messages (v)
                    IsTxConfirmed = true;
                    ComplianceTest.State = 1;
                    break;
                case 3: // Disable confirmed messages (vi)
                    IsTxConfirmed = false;
                    ComplianceTest.State = 1;
                    break;
                case 4: // (vii)
                    AppDataSize = mcpsIndication->BufferSize;

                    AppData[0] = 4;
                    for (uint8_t i = 1; i < MIN(AppDataSize, LORAWAN_APP_DATA_MAX_SIZE); i++)
                    {
                        AppData[i] = mcpsIndication->Buffer[i] + 1;
                    }
                    break;
                case 5: // (viii)
                {
                    MlmeReq_t mlmeReq;
                    mlmeReq.Type = MLME_LINK_CHECK;
                    LoRaMacMlmeRequest(&mlmeReq);
                }
                break;
                case 6: // (ix)
                {
                    MlmeReq_t mlmeReq;

                    // Disable TestMode and revert back to normal operation
                    IsTxConfirmed = LORAWAN_CONFIRMED_MSG_ON;
                    AppPort = LORAWAN_APP_PORT;
                    AppDataSize = AppDataSizeBackup;
                    ComplianceTest.DownLinkCounter = 0;
                    ComplianceTest.Running = false;

                    MibRequestConfirm_t mibReq;
                    mibReq.Type = MIB_ADR;
                    mibReq.Param.AdrEnable = LORAWAN_ADR_ON;
                    LoRaMacMibSetRequestConfirm(&mibReq);
#if defined(REGION_EU868)
                    LoRaMacTestSetDutyCycleOn(LORAWAN_DUTYCYCLE_ON);
#endif

                    mlmeReq.Type = MLME_JOIN;

                    mlmeReq.Req.Join.DevEui = DevEui;
                    mlmeReq.Req.Join.AppEui = AppEui;
                    mlmeReq.Req.Join.AppKey = AppKey;
                    mlmeReq.Req.Join.Datarate = LORAWAN_DEFAULT_DATARATE;

                    if (LoRaMacMlmeRequest(&mlmeReq) == LORAMAC_STATUS_OK)
                    {
                        DeviceState = DEVICE_STATE_SLEEP;
                    }
                    else
                    {
                        DeviceState = DEVICE_STATE_CYCLE;
                    }
                }
                break;
                case 7: // (x)
                {
                    if (mcpsIndication->BufferSize == 3)
                    {
                        MlmeReq_t mlmeReq;
                        mlmeReq.Type = MLME_TXCW;
                        mlmeReq.Req.TxCw.Timeout = (uint16_t)((mcpsIndication->Buffer[1] << 8) | mcpsIndication->Buffer[2]);
                        LoRaMacMlmeRequest(&mlmeReq);
                    }
                    else if (mcpsIndication->BufferSize == 7)
                    {
                        MlmeReq_t mlmeReq;
                        mlmeReq.Type = MLME_TXCW_1;
                        mlmeReq.Req.TxCw.Timeout = (uint16_t)((mcpsIndication->Buffer[1] << 8) | mcpsIndication->Buffer[2]);
                        mlmeReq.Req.TxCw.Frequency = (uint32_t)((mcpsIndication->Buffer[3] << 16) | (mcpsIndication->Buffer[4] << 8) | mcpsIndication->Buffer[5]) * 100;
                        mlmeReq.Req.TxCw.Power = mcpsIndication->Buffer[6];
                        LoRaMacMlmeRequest(&mlmeReq);
                    }
                    ComplianceTest.State = 1;
                }
                break;
                default:
                    break;
                }
            }
            break;
        default:
            isConfirmed = false;
            break;
        }
    }

    // Switch LED 1 ON for each received downlink
    GpioWrite(&Led1, 0);
    TimerStart(&Led2Timer);
}

/*!
 * \brief	 MLME-Confirm event function
 *
 * \param	 [IN] mlmeConfirm - Pointer to the confirm structure,
 *							 containing confirm attributes.
 */
static void MlmeConfirm(MlmeConfirm_t *mlmeConfirm)
{
    switch (mlmeConfirm->MlmeRequest)
    {
    case MLME_JOIN:
    {
        if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
        {
            // Status is OK, node has joined the network
            DeviceState = DEVICE_STATE_SEND;
        }
        else
        {
            // Join was not successful. Try to join again
            MlmeReq_t mlmeReq;
            mlmeReq.Type = MLME_JOIN;
            mlmeReq.Req.Join.DevEui = DevEui;
            mlmeReq.Req.Join.AppEui = AppEui;
            mlmeReq.Req.Join.AppKey = AppKey;
            mlmeReq.Req.Join.Datarate = LORAWAN_DEFAULT_DATARATE;

            if (LoRaMacMlmeRequest(&mlmeReq) == LORAMAC_STATUS_OK)
            {
                DeviceState = DEVICE_STATE_SLEEP;
            }
            else
            {
                DeviceState = DEVICE_STATE_CYCLE;
            }
        }
        break;
    }
    case MLME_LINK_CHECK:
    {
        if (mlmeConfirm->Status == LORAMAC_EVENT_INFO_STATUS_OK)
        {
            // Check DemodMargin
            // Check NbGateways
            if (ComplianceTest.Running == true)
            {
                ComplianceTest.LinkCheck = true;
                ComplianceTest.DemodMargin = mlmeConfirm->DemodMargin;
                ComplianceTest.NbGateways = mlmeConfirm->NbGateways;
            }
        }
        break;
    }
    default:
        break;
    }
    NextTx = true;
}

/*!
 * \brief	 MLME-Indication event function
 *
 * \param	 [IN] mlmeIndication - Pointer to the indication structure.
 */
static void MlmeIndication(MlmeIndication_t *mlmeIndication)
{
    switch (mlmeIndication->MlmeIndication)
    {
    case MLME_SCHEDULE_UPLINK:
    { // The MAC signals that we shall provide an uplink as soon as possible
        OnTxNextPacketTimerEvent();
        break;
    }
    default:
        break;
    }
}

//-------------------------------------------------------------------------------------------------------//

