AhmtYldz0772/deneme/SHM/SHM_20211202/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/NETAS_Photon_Firmware _FreeRTOS-eski/main.c
    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}

void HardFault_Handler(void)
{
    uint32_t *sp = (uint32_t *)__get_MSP(); // Get stack pointer
    uint32_t ia = sp[12];                   // Get instruction address from stack

    //    printf("Hard Fault at address: 0x%08x\r\n", (unsigned int)ia);
    while (1)
        ;
}

#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void *arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif //NRF_LOG_ENABLED

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook(void)
{
#if NRF_LOG_ENABLED
    vTaskResume(m_logger_thread);
#endif
}

static void lorawan_state_machine_task(void * pvParameter)
{
    LoRaMacPrimitives_t LoRaMacPrimitives;
    LoRaMacCallback_t LoRaMacCallbacks;
    MibRequestConfirm_t mibReq;

    // Tick the RTC to execute callback in context of the main loop (in stead of the IRQ)
    while (1)
    {
        if (isBLEConnected == false)
        {
            TimerProcess();

            switch (DeviceState)
            {
            case DEVICE_STATE_INIT:
            {
                LoRaMacPrimitives.MacMcpsConfirm = McpsConfirm;
                LoRaMacPrimitives.MacMcpsIndication = McpsIndication;
                LoRaMacPrimitives.MacMlmeConfirm = MlmeConfirm;
                LoRaMacPrimitives.MacMlmeIndication = MlmeIndication;
                LoRaMacCallbacks.GetBatteryLevel = BoardGetBatteryLevel;
                LoRaMacInitialization(&LoRaMacPrimitives, &LoRaMacCallbacks, ACTIVE_REGION);

                TimerInit(&TxNextPacketTimer, OnTxNextPacketTimerEvent);

                TimerInit(&Led1Timer, OnLed1TimerEvent);
                TimerSetValue(&Led1Timer, 25);

                TimerInit(&Led2Timer, OnLed2TimerEvent);
                TimerSetValue(&Led2Timer, 25);

                mibReq.Type = MIB_ADR;
                mibReq.Param.AdrEnable = LORAWAN_ADR_ON;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_SYSTEM_MAX_RX_ERROR;
                mibReq.Param.SystemMaxRxError = 20;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_PUBLIC_NETWORK;
                mibReq.Param.EnablePublicNetwork = LORAWAN_PUBLIC_NETWORK;
                LoRaMacMibSetRequestConfirm(&mibReq);

#if defined(REGION_EU868)
                LoRaMacTestSetDutyCycleOn(LORAWAN_DUTYCYCLE_ON);
#endif

#if (USE_TTN_NETWORK == 1)
                mibReq.Type = MIB_RX2_DEFAULT_CHANNEL;
                mibReq.Param.Rx2DefaultChannel = (Rx2ChannelParams_t){869525000, DR_3};
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_RX2_CHANNEL;
                mibReq.Param.Rx2Channel = (Rx2ChannelParams_t){869525000, DR_3};
                LoRaMacMibSetRequestConfirm(&mibReq);
#endif

                static MulticastParams_t channelParam;

                channelParam.Address = (uint32_t)0x11223344;

                channelParam.AppSKey[0] = 0x2B;
                channelParam.AppSKey[1] = 0x7E;
                channelParam.AppSKey[2] = 0x15;
                channelParam.AppSKey[3] = 0x16;
                channelParam.AppSKey[4] = 0x28;
                channelParam.AppSKey[5] = 0xAE;
                channelParam.AppSKey[6] = 0xD2;
                channelParam.AppSKey[7] = 0xA6;
                channelParam.AppSKey[8] = 0xAB;
                channelParam.AppSKey[9] = 0xF7;
                channelParam.AppSKey[10] = 0x15;
                channelParam.AppSKey[11] = 0x88;
                channelParam.AppSKey[12] = 0x09;
                channelParam.AppSKey[13] = 0xCF;
                channelParam.AppSKey[14] = 0x4F;
                channelParam.AppSKey[15] = 0x3C;

                channelParam.NwkSKey[0] = 0x2B;
                channelParam.NwkSKey[1] = 0x7E;
                channelParam.NwkSKey[2] = 0x15;
                channelParam.NwkSKey[3] = 0x16;
                channelParam.NwkSKey[4] = 0x28;
                channelParam.NwkSKey[5] = 0xAE;
                channelParam.NwkSKey[6] = 0xD2;
                channelParam.NwkSKey[7] = 0xA6;
                channelParam.NwkSKey[8] = 0xAB;
                channelParam.NwkSKey[9] = 0xF7;
                channelParam.NwkSKey[10] = 0x15;
                channelParam.NwkSKey[11] = 0x88;
                channelParam.NwkSKey[12] = 0x09;
                channelParam.NwkSKey[13] = 0xCF;
                channelParam.NwkSKey[14] = 0x4F;
                channelParam.NwkSKey[15] = 0x3C;

                channelParam.DownLinkCounter = 0;

                channelParam.Next = 0;
                //				LoRaMacMulticastChannelLink(&channelParam);

                mibReq.Type = MIB_MULTICAST_CHANNEL;
                mibReq.Param.MulticastList = &channelParam;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_DEVICE_CLASS;
                mibReq.Param.Class = CLASS_C;
                LoRaMacMibSetRequestConfirm(&mibReq);
                DeviceState = DEVICE_STATE_JOIN;

                break;
            }
            case DEVICE_STATE_JOIN:
            {
#if (OVER_THE_AIR_ACTIVATION != 0)
                MlmeReq_t mlmeReq;

                // Initialize LoRaMac device unique ID
                BoardGetUniqueId(DevEui);

                mlmeReq.Type = MLME_JOIN;

                mlmeReq.Req.Join.DevEui = DevEui;
                mlmeReq.Req.Join.AppEui = AppEui;
                mlmeReq.Req.Join.AppKey = AppKey;
                mlmeReq.Req.Join.Datarate = LORAWAN_DEFAULT_DATARATE;

                if (LoRaMacMlmeRequest(&mlmeReq) == LORAMAC_STATUS_OK)
                {
                    DeviceState = DEVICE_STATE_SLEEP;
                }
                else
                {
                    DeviceState = DEVICE_STATE_CYCLE;
                }
#else
                // Choose a random device address if not already defined in Commissioning.h
                if (DevAddr == 0)
                {
                    // Random seed initialization
                    srand1(BoardGetRandomSeed());

                    // Choose a random device address
                    DevAddr = randr(0, 0x01FFFFFF);
                }

                mibReq.Type = MIB_NET_ID;
                mibReq.Param.NetID = LORAWAN_NETWORK_ID;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_DEV_ADDR;
                mibReq.Param.DevAddr = DevAddr;
                LoRaMacMibSetRequestConfirm(&mibReq);

