AhmtYldz0772/deneme/SHM/SHM_20211202/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/NETAS_Photon_Firmware _FreeRTOS-eski/main.c
                mibReq.Type = MIB_NWK_SKEY;
                mibReq.Param.NwkSKey = NwkSKey;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_APP_SKEY;
                mibReq.Param.AppSKey = AppSKey;
                LoRaMacMibSetRequestConfirm(&mibReq);

                mibReq.Type = MIB_NETWORK_JOINED;
                mibReq.Param.IsNetworkJoined = true;
                LoRaMacMibSetRequestConfirm(&mibReq);

                DeviceState = DEVICE_STATE_SEND;
#endif
                break;
            }
            case DEVICE_STATE_SEND:
            {
                if (NextTx == true)
                {
                    if (isConfirmed == true)
                    {
                        PrepareTxFrame(0);
                    }
                    else
                    {
                        PrepareTxFrame(AppPort);
                    }

                    NextTx = SendFrame();
                }
                if (ComplianceTest.Running == true)
                {
                    // Schedule next packet transmission
                    TxDutyCycleTime = 5000; // 5000 ms
                }
                else
                {
                    // Schedule next packet transmission
                    TxDutyCycleTime = APP_TX_DUTYCYCLE + randr(-APP_TX_DUTYCYCLE_RND, APP_TX_DUTYCYCLE_RND);
                }
                DeviceState = DEVICE_STATE_CYCLE;
                break;
            }
            case DEVICE_STATE_CYCLE:
            {
                DeviceState = DEVICE_STATE_SLEEP;

                // Schedule next packet transmission
                TimerSetValue(&TxNextPacketTimer, TxDutyCycleTime);
                TimerStart(&TxNextPacketTimer);
                break;
            }
            case DEVICE_STATE_SLEEP:
            {
                // Wake up through events
                // TimerLowPowerHandler( );
                break;
            }
            default:
            {
                DeviceState = DEVICE_STATE_INIT;
                break;
            }
            }
        }
    }
}

/**@brief Function for application main entry.
 */
int main(void)
{

    BoardInitMcu();
    BoardInitPeriph();
    //    if (InitializeMetrology() != true)
    //    {
    //        while (1)
    //            ; /* TODO: Needs to be fixed!. */
    //    }
    //    else
    //    {
    //        voltageValue = GetRMSVoltage();
    //        if (voltageValue != 0)
    //        {
    //
    //        }
    //        else
    //        {
    //        }
    //    }

    DeviceState = DEVICE_STATE_INIT;
    bool erase_bonds;

    // Initialize.
    timers_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();
    // Start execution.
    application_timers_start();

#if NRF_LOG_ENABLED
    // Start execution.
    if (pdPASS != xTaskCreate(logger_thread, "LOGGER", 256, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif
    BaseType_t xReturned = xTaskCreate(lorawan_state_machine_task, "LORAWANSTATEMACHINE", 256, NULL, 2, &m_lorawan_state_machine_thread);
   if (xReturned != pdPASS)
    {
        NRF_LOG_ERROR("SoftDevice task not created.");
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
    
    // Create a FreeRTOS task for the BLE stack.
    // The task will run advertising_start() before entering its loop.
   // nrf_sdh_freertos_init(advertising_start, &erase_bonds);

    NRF_LOG_INFO("Started.");
    // Start FreeRTOS scheduler.
    vTaskStartScheduler();

    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }

    //   advertising_start(erase_bonds);
    //applyPORSequence(); /* Apply Power on Reset sequence to STPM32. */
}

/**
 * @}
 */